In [15]:
import pandas as pd

data = pd.read_csv('duplicates.csv')

In [16]:
data

,Unnamed: 0,First Name,Initials,Inns,NO,Runs,HS,100s,Avg,S/R,Year
0,1,Tendulkar,SR,33,4,1894,143,9,65.31,102.16,1998
1,2,Ganguly,SC,32,4,1579,144,7,56.39,82.76,2000
2,3,Sharma*,RG,27,1,1490,159,7,57.31,89.92,2019
3,4,Ganguly,SC,32,4,1579,144,7,56.39,82.76,2000
4,5,Kohli*,V,26,7,1460,131,6,76.84,99.12,2017
5,6,Kohli*,V,14,5,1202,160*,6,133.56,102.56,2018
6,7,Sharma*,RG,21,3,1293,208*,6,71.83,99.46,2017
7,8,Dravid,R,43,5,1761,153,6,46.34,75.16,1999
8,9,Tendulkar,SR,32,2,1611,137,6,53.70,82.45,1996
9,10,Ponting,RT,31,6,1154,140*,5,46.16,81.67,2003
10,11,Ponting,RT,24,6,1424,134*,5,79.11,91.69,2007
11,12,Kohli*,V,26,7,1460,131,6,76.84,99.12,2017
12,13,Tendulkar,SR,33,4,1894,143,9,65.31,102.16,1998
13,14,Sharma*,RG,19,5,1030,162,5,73.57,100.10,2018

In [18]:
# dropping first column

data.drop(columns='Unnamed: 0', inplace = True)

In [21]:
# sorting by first name and year

data.sort_values(['First Name', 'Year'], inplace = True, ignore_index = True)

In [22]:
data

   First Name Initials  Inns  NO  Runs    HS  100s     Avg     S/R  Year
0      Dravid        R    43   5  1761   153     6   46.34   75.16  1999
1     Ganguly       SC    32   4  1579   144     7   56.39   82.76  2000
2     Ganguly       SC    32   4  1579   144     7   56.39   82.76  2000
3      Kohli*        V    26   7  1460   131     6   76.84   99.12  2017
4      Kohli*        V    26   7  1460   131     6   76.84   99.12  2017
5      Kohli*        V    14   5  1202  160*     6  133.56  102.56  2018
6     Ponting       RT    31   6  1154  140*     5   46.16   81.67  2003
7     Ponting       RT    24   6  1424  134*     5   79.11   91.69  2007
8     Sharma*       RG    21   3  1293  208*     6   71.83   99.46  2017
9     Sharma*       RG    19   5  1030   162     5   73.57  100.10  2018
10    Sharma*       RG    27   1  1490   159     7   57.31   89.92  2019
11  Tendulkar       SR    32   2  1611   137     6   53.70   82.45  1996
12  Tendulkar       SR    33   4  1894   143     9   65.31  102.16  1998
13  Tendulkar       SR    33   4  1894   143     9   65.31  102.16  1998

In [25]:
# Count of unique values in a columns

data['First Name'].nunique()

6

**Determining duplicated rows in DataFrame using .duplicated() function**

In [26]:
data.duplicated()

0     False
1     False
2      True
3     False
4      True
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13     True
dtype: bool

In [37]:
# count of duplicated rows in a DataFrame

data.duplicated().sum()

np.int64(3)

In [38]:
# count of duplicated values in a column

data['First Name'].duplicated().sum()

np.int64(8)

In [39]:
# count of duplicates with reagrds to values in specified columns

data.duplicated(subset = ['First Name', 'NO']).sum()

np.int64(4)

In [41]:
# extracting duplicate rows from a DataFrame

data.loc[data.duplicated(), :]

   First Name Initials  Inns  NO  Runs   HS  100s    Avg     S/R  Year
2     Ganguly       SC    32   4  1579  144     7  56.39   82.76  2000
4      Kohli*        V    26   7  1460  131     6  76.84   99.12  2017
13  Tendulkar       SR    33   4  1894  143     9  65.31  102.16  1998

**Dropping duplicate rows in a DataFrame uisng .drop_duplicate() function**

In [43]:
data.drop_duplicates(inplace = True)

In [44]:
data

   First Name Initials  Inns  NO  Runs    HS  100s     Avg     S/R  Year
0      Dravid        R    43   5  1761   153     6   46.34   75.16  1999
1     Ganguly       SC    32   4  1579   144     7   56.39   82.76  2000
3      Kohli*        V    26   7  1460   131     6   76.84   99.12  2017
5      Kohli*        V    14   5  1202  160*     6  133.56  102.56  2018
6     Ponting       RT    31   6  1154  140*     5   46.16   81.67  2003
7     Ponting       RT    24   6  1424  134*     5   79.11   91.69  2007
8     Sharma*       RG    21   3  1293  208*     6   71.83   99.46  2017
9     Sharma*       RG    19   5  1030   162     5   73.57  100.10  2018
10    Sharma*       RG    27   1  1490   159     7   57.31   89.92  2019
11  Tendulkar       SR    32   2  1611   137     6   53.70   82.45  1996
12  Tendulkar       SR    33   4  1894   143     9   65.31  102.16  1998

In [49]:
# Selecting the first duplicate row

data.drop_duplicates(subset = 'First Name', keep = 'first')

   First Name Initials  Inns  NO  Runs    HS  100s    Avg    S/R  Year
0      Dravid        R    43   5  1761   153     6  46.34  75.16  1999
1     Ganguly       SC    32   4  1579   144     7  56.39  82.76  2000
3      Kohli*        V    26   7  1460   131     6  76.84  99.12  2017
6     Ponting       RT    31   6  1154  140*     5  46.16  81.67  2003
8     Sharma*       RG    21   3  1293  208*     6  71.83  99.46  2017
11  Tendulkar       SR    32   2  1611   137     6  53.70  82.45  1996

In [51]:
# Selecting the last duplicate row

data.drop_duplicates(subset = 'First Name', keep = 'last')

   First Name Initials  Inns  NO  Runs    HS  100s     Avg     S/R  Year
0      Dravid        R    43   5  1761   153     6   46.34   75.16  1999
1     Ganguly       SC    32   4  1579   144     7   56.39   82.76  2000
5      Kohli*        V    14   5  1202  160*     6  133.56  102.56  2018
7     Ponting       RT    24   6  1424  134*     5   79.11   91.69  2007
10    Sharma*       RG    27   1  1490   159     7   57.31   89.92  2019
12  Tendulkar       SR    33   4  1894   143     9   65.31  102.16  1998

In [52]:
# Dropping all duplicate rows of a DataFrame

data.drop_duplicates(subset = ['First Name'], keep = False)  # to get unique first name values

  First Name Initials  Inns  NO  Runs   HS  100s    Avg    S/R  Year
0     Dravid        R    43   5  1761  153     6  46.34  75.16  1999
1    Ganguly       SC    32   4  1579  144     7  56.39  82.76  2000